src/testCases/conduction1D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    surrounding
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       11;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       59;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       60;
    }
)

// ************************************************************************* //
