src/testCases/conduction1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

area 1e-2;
length 0.5;

xmin 0;
xmax $length;
ymin 0;
ymax $area;
zmin -0.5;
zmax 0.5;
xmid1 0.25;
xmid2 0.3;


vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
    
    ($xmid2 $ymin $zmin)
    ($xmid1 $ymax $zmin)
    ($xmid2 $ymin $zmax)
    ($xmid1 $ymax $zmax)
);

blocks
(
    hex (0 8 9 3 4 10 11 7) (6 1 1) simpleGrading (1 1 1)
    hex (8 1 2 9 10 5 6 11) (6 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    surrounding
    {
        type wall;
        faces
        (
            (7 11 9 3)
            (11 6 2 9)
            (0 8 10 4)
            (8 1 5 10)
            (9 8 0 3)
            (9 2 1 8)
            (4 10 11 7)
            (10 5 6 11)
        );
    }
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
